{
  "backend/main.mo": "Defines the backend canister with user profiles, vault settings, media items, albums, and access control, including CRUD-style operations and authorization checks.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend files for quick reference during build planning.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH-based color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app.",
  "frontend/src/App.tsx": "Top-level app component handling authentication, profile gating, theming, and view routing.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button integrating Internet Identity with login/logout and state handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter and save their display name.",
  "frontend/src/components/editor/ImageEditorModal.tsx": "Modal for editing images with brightness, contrast, rotation, and filters, rendering to canvas and saving as a new media item.",
  "frontend/src/components/layout/AppHeader.tsx": "App header with navigation buttons for switching views and a login button.",
  "frontend/src/components/media/MediaGrid.tsx": "Infinite-scroll media grid that displays thumbnails and loads more items as the user scrolls.",
  "frontend/src/components/media/MediaUploader.tsx": "Uploader for images and videos that creates thumbnails, tracks upload progress, and saves new media items.",
  "frontend/src/components/media/MediaViewerModal.tsx": "Modal viewer for photos and videos with editing, lock toggling, and metadata display.",
  "frontend/src/components/vault/PinSetupModal.tsx": "Modal for setting a new vault PIN with validation and submission handling.",
  "frontend/src/components/vault/VaultUnlockModal.tsx": "Modal for entering and verifying a vault PIN to unlock protected items.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAlbums.ts": "React Query hooks to fetch, add, and reorder albums using an actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider for login, identity loading, and auth state management.",
  "frontend/src/hooks/useLibrary.ts": "React Query hooks for fetching media, adding media items, and retrieving library metadata.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and update the caller's user profile through the actor API.",
  "frontend/src/hooks/useVault.ts": "Hooks for vault status queries, PIN management, unlocking, and local unlocked state tracking.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables and base styling.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/pages/AlbumsPage.tsx": "Albums listing page with album creation dialog and identity‑based album creation.",
  "frontend/src/pages/LibraryPage.tsx": "Displays media library with upload, filtering of locked items, and a media viewer modal.",
  "frontend/src/pages/LoginScreen.tsx": "Login screen presenting branding and an Internet Identity login button.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page for theme switching and metadata backup/import options.",
  "frontend/src/pages/VaultPage.tsx": "Vault page that loads media and vault PIN status, shows setup/unlock flows, and displays locked media in a grid with viewer modal.",
  "frontend/src/utils/imageEditing.ts": "Provides an interface for image edit parameters and a function that applies brightness, contrast, rotation, and filter effects to an image via canvas and returns the edited bytes.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and clearing them from URL/hash for routing and state retention.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, container settings, shadows, and plugin integrations.",
  "project_state.json": "Project metadata describing app features, requirements, known issues, and image asset needs for a photo gallery and vault app."
}