{
  "backend/main.mo": "Motoko actor implementing user profiles, vault settings, access control, and media/album storage with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping requested UI fixes and build requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including hooks, pages, components, and utilities.",
  "frontend/index.css": "Global Tailwind/OKLCH theme variables and base styles, including dark mode tokens and border/background defaults.",
  "frontend/index.html": "Base HTML entry point defining metadata, manifest links, and the root mount point for the React app.",
  "frontend/public/site.webmanifest": "PWA manifest specifying app name, colors, startup behavior, and icons.",
  "frontend/src/App.tsx": "Main authenticated app shell handling view switching, profile setup gating, theming, and layout structure.",
  "frontend/src/components/auth/LoginButton.tsx": "Responsive login/logout button with loading state, error handling, and full-width mobile variant.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users for their display name with form validation and profile creation.",
  "frontend/src/components/editor/ImageEditorModal.tsx": "Modal for editing images with brightness, contrast, rotation, filters, and saving edited copies as new media items.",
  "frontend/src/components/layout/AppHeader.tsx": "Responsive app header with navigation, logo, login button, and mobile menu drawer.",
  "frontend/src/components/media/MediaGrid.tsx": "Paged grid displaying media thumbnails with infinite scroll and video indicators.",
  "frontend/src/components/media/MediaUploader.tsx": "Uploader for images and videos that generates thumbnails, tracks progress, and saves new media items.",
  "frontend/src/components/media/MediaViewerModal.tsx": "Modal viewer for photos and videos with lock toggle and image editing access.",
  "frontend/src/components/settings/AndroidAccessHelpGuide.tsx": "Guide explaining how Android users can add the app to their home screen with screenshots.",
  "frontend/src/components/settings/OpenShareAppLinkSection.tsx": "Section showing the current app URL with options to copy or open it in a new tab.",
  "frontend/src/components/vault/PinSetupModal.tsx": "Modal for creating and confirming a new vault PIN and submitting it via useSetVaultPIN.",
  "frontend/src/components/vault/VaultUnlockModal.tsx": "Modal for entering a PIN to unlock the vault using useUnlockVault and triggering onUnlock on success.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAlbums.ts": "React-query hooks to fetch, create, and reorder albums through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and handling login/logout flows.",
  "frontend/src/hooks/useLibrary.ts": "React-query hooks for fetching and modifying media items and library metadata via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and saving the caller’s user profile with react-query and the backend actor.",
  "frontend/src/hooks/useVault.ts": "Hooks for vault status fetching, PIN setting, unlocking, and local unlocked state management.",
  "frontend/src/index.css": "Tailwind base styles and theme CSS variables for light/dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AlbumsPage.tsx": "Albums page that lists albums, shows loading state, and includes a dialog for creating new albums.",
  "frontend/src/pages/LibraryPage.tsx": "Displays all visible media, handling locked items based on vault state and offering upload and modal viewing.",
  "frontend/src/pages/LoginScreen.tsx": "Renders the login screen with branding and a button for user authentication.",
  "frontend/src/pages/SettingsPage.tsx": "Provides appearance settings, backup/restore actions, and helper sections for app access and sharing.",
  "frontend/src/pages/VaultPage.tsx": "Manages locked media access with PIN setup, unlocking flow, and displays locked items with a viewer modal.",
  "frontend/src/utils/imageEditing.ts": "Applies brightness, contrast, rotation, and filter edits to an image via canvas and returns the result as bytes.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters for routing and state.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, container settings, and plugins.",
  "project_state.json": "Describes the project state, known issues, and existing features for the Vault Gallery app."
}