{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Vault Gallery: Mobile header and app-shell layout fixes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the top app header responsive on small screens to prevent nav/auth overflow while keeping navigation usable.",
      "acceptanceCriteria": [
        "On narrow viewports (e.g., 360–430px wide), the header content fits within the viewport without horizontal scrolling or clipped buttons.",
        "Navigation remains fully usable on mobile (e.g., via a collapsed menu, icon-only buttons, or a horizontally scrollable nav that remains discoverable).",
        "The Login/Logout control remains accessible on mobile without overlapping other controls.",
        "No regression on desktop/tablet layouts; the current header layout remains usable and visually consistent at >= 768px width."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Refactor header layout for mobile: switch to a responsive structure (e.g., stacked rows or collapsed nav) so Library/Albums/Vault/Settings and the auth control never overflow; preserve the current desktop/tablet presentation at >=768px. Continue using the shadcn-ui Button component for consistent styling and interaction states; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Make the Login/Logout control responsive (e.g., icon-only or compact variant on small screens with accessible labels) so it stays reachable without forcing horizontal overflow. Continue using the shadcn-ui Button component for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global safeguards to prevent accidental horizontal scrolling on small screens (e.g., ensure the app does not introduce unintended horizontal overflow), without changing the overall theme tokens."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix app-shell/main layout so pages render and scroll correctly beneath the header on mobile with no blank panels or hidden content.",
      "acceptanceCriteria": [
        "When switching between views on mobile, the main content area is visible and scrollable as expected (e.g., Library grid and page headers are not hidden behind the app header).",
        "No unintended blank/empty panel occupies the majority of the screen after navigation on mobile.",
        "Pages that already manage their own scrolling (e.g., `h-full overflow-auto`) continue to scroll properly within the app shell."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust the app shell flex layout to correctly allocate height between header and main content on mobile (e.g., ensure the main region can shrink with `min-h-0` patterns and avoids creating empty space), while keeping existing view switching behavior intact."
        },
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Align header sizing with the updated app shell (e.g., avoid fixed-height assumptions that break when the header wraps/collapses on mobile) so the main area consistently starts beneath the header."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the frontend build succeeds after responsive header and layout updates, with no new console/runtime errors when switching views.",
      "acceptanceCriteria": [
        "`frontend` production build succeeds without TypeScript errors.",
        "No runtime console errors are introduced in the header/navigation code paths when switching views."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Clean up and harden the updated header implementation for build stability (e.g., correct types, remove unused imports, ensure mobile menu state is consistent across view switches)."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Verify the auth button changes remain type-safe and do not introduce runtime issues (e.g., consistent disabled states, labels, and click handling) after responsive adjustments."
        }
      ]
    }
  ]
}